# 서비스 이용약관

## 1. 총칙
1.1 'soo:bak'이 운영하는 서비스 BOB - Basis Of Bitwise('서비스'라 한다)에 관한 이용약관은 'soo:bak'와 이용자의 권리·의무 및 책임 사항을 규정함을 목적으로 합니다.
1.2 이 약관은 'soo:bak'의 정한 바에 따라 개정될 수 있으며, 개정된 약관은 '서비스' 및 'soo:bak'의 웹사이트에 공지함으로써 효력을 발휘합니다.

## 2. 서비스의 제공 및 변경
2.1 'soo:bak'은 이용자에게 다음과 같은 서비스를 제공합니다.
- Google OAuth를 이용한 로그인 서비스
2.2 'soo:bak'은 필요한 경우 서비스의 내용을 변경할 수 있으며, 변경된 내용은 'soo:bak'의 웹사이트에 공지합니다.

## 3. 서비스의 중단
3.1 'soo:bak'은 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
3.2 'soo:bak'은 서비스의 제공을 더 이상 경제적이거나 기술적으로 불가능하다는 판단에 이르게 되면, 서비스를 전부 중단할 수 있습니다.

## 4. 이용자의 의무
4.1 이용자는 이 약관에서 규정하는 사항과 '서비스' 이용안내 및 주의사항 등 'soo:bak'가 통지하는 사항을 준수해야 하며, 기타 'soo:bak'의 업무에 방해되는 행위를 하여서는 안됩니다.

## 5. 서비스 이용제한
5.1 'soo:bak'은 이용자가 이 약관의 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우, 서비스 이용을 제한할 수 있습니다.

## 6. 준거법 및 재판관할
6.1 'soo:bak'와 이용자 간 제기된 소송은 대한민국 법을 준거법으로 합니다.
6.2 'soo:bak'와 이용자간 발생한 분쟁에 관한 소송은 민사소송법 상의 관할법원에 제기합니다.

이 약관은 2023년 7월 1일부터 적용됩니다.
