# 개인정보처리방침

'soo:bak'은(는) 개인정보보호법을 준수하고 있으며, 'soo:bak'의 중요한 개인정보보호 의무에 따라 개인정보 처리방침을 공개합니다. 'soo:bak'은 개인정보처리방침을 통해 개인정보를 어떻게 수집, 이용 및 관리하는지에 대한 정보를 제공합니다.

## 1. 개인정보의 처리 목적
'soo:bak'는 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않습니다.

- 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산, 콘텐츠 제공

## 2. 개인정보의 처리 및 보유 기간
'soo:bak'는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.

## 3. 개인정보의 제3자 제공
'soo:bak'는 개인정보를 제3자에게 제공하지 않습니다.

## 4. 개인정보처리 위탁
'soo:bak'는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
- 위탁 대상자 : Google
- 위탁하는 업무의 내용 : OAuth를 이용한 로그인 서비스 제공

## 5. 정보주체와 법정대리인의 권리·의무 및 행사방법
정보주체는 'soo:bak'에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.

1) 개인정보 열람요구
2) 오류 등이 있을 경우 정정 요구
3) 삭제요구
4) 처리정지 요구

## 6. 처리하는 개인정보의 항목
'soo:bak'는 다음의 개인정보 항목을 처리하고 있습니다.
- 이메일, 서비스 이용 기록, 접속 로그

## 7. 개인정보의 파기
'soo:bak'는 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다.

## 8. 개인정보 자동 수집 장치의 설치, 운영 및 그 거부에 관한 사항
'soo:bak'는 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키’를 사용합니다.

## 9. 개인정보 보호책임자 작성
'soo:bak'는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

- 이름 : 최진영
- 연락처 : znyous@gmail.com

이 개인정보처리방침은 2023년 7월 1일부터 적용됩니다.
